print ('       Start programm')
print (' ')
# Задача:
# Напишите 4 переменных которые буду обозначать следующие данные:
# 1. Количество выполненных ДЗ (запишите значение 12)
# 2. Количество затраченных часов (запишите значение 1.5)
# 3. Название курса (запишите значение 'Python')
# Время на одно задание (вычислить используя 1 и 2 переменные)
# 4. Выведите на экран(в консоль), используя переменные, следующую строку:
# Курс: Python, всего задач:12, затрачено часов: 1.5, среднее время выполнения 0.125 часа.
name = 'Konstantin'
complete_dz = 12
loadHours = 1.5
course = 'Python'
print('Курс: ', course, ', всего задач: ', complete_dz , ', затрачено часов: ', loadHours , ', среднее время выполнения: ' , (loadHours/complete_dz), ' часа.' )
print (' ')
print ('       The programm is ready')
print (' ')
print('Thank you for the practice, have a nice day =)')