print ('       Start programm. String PRACTICE 1')
# В переменную example запишите любую строку.
a = 'University'
# Выполните следующие действия в PyCharm:
print (' ')
print('Challenge 1.: Выведите на экран(в консоль) первый символ этой строки')
# 1. Выведите на экран(в консоль) первый символ этой строки.
print(a[0]) # U
print (' ')
print('Challenge 2.: Выведите на экран(в консоль) последний символ этой строки (используя отрицательный индекс)')
# 2. Выведите на экран(в консоль) последний символ этой строки (используя отрицательный индекс).
print(a[-1]) # y
print (' ')
print('Challenge 3.: Выведите на экран(в консоль) вторую половину этой строки (С нечётным количеством символов: Urban -> ban)')
# 3. Выведите на экран(в консоль) вторую половину этой строки (С нечётным количеством символов: 'Urban' -> 'ban').
print(a[5:10]) #rsity
print (' ')
print('Challenge 4.: Выведите на экран(в консоль) это слово наоборот')
# 4. Выведите на экран(в консоль) это слово наоборот.
print(a[::-1]) # ytisrevinU
print (' ')
print('Challenge 5.: Выведите на экран(в консоль) каждый второй символ этой строки. (Пример: Топинамбур-> оиабр)')
# 5. Выведите на экран(в консоль) каждый второй символ этой строки. (Пример: 'Топинамбур'->'оиабр')
print(a[1:10:2]) # nvriy
print (' ')
print('Thank you for the practice, have a nice day =)')